[
  {
    "headline": "Computer Vision, Image Processing",
    "texts": [
"One field that really interests me is Computer Vision. I find it fascinating because of its huge potential. My favorite topics within this field are segmentation, object detection, and tracking. I have worked on several projects related to these topics, and I am always eager to learn more and discuss this exciting field."
    ],
    "imageName": "cv",
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Web Development",
    "texts": [
"I have the most experience in the field of web development. I have been working as a web developer since 2021 and have experience in various stacks, such as Python-Flask, .NET, React with Typescript. I am always interested in topics related to this field and open to learning new topics in it."
    ],
    "imageName": "webdev",
    "config": {
      "wrap": "mobile"
    }

  },
  {
    "headline": "Data Science",
    "texts": [
"I learned data science at university and I really enjoyed it. I completed several projects such as sports analytics, web scraping, and time-series analysis. I find every topic in this field interesting, especially those that are closely related to programming and engineering. However, I'm not a big fan of visualization and similar topics."
    ],
    "imageName": "-",
    "config": {
      "wrap": "mobile"
    }

  },
  {
    "headline": "Web3",
    "texts": [
"I am very interested in web3 topics, although I do not have much experience in the field. I created a smart contract project during my university days, which I thoroughly enjoyed. I am always open to discussing this field and would be keen to work on projects that can help me gain more experience."
    ],
    "imageName": "-",
    "config": {
      "wrap": "mobile"
    }

  },
  {
    "headline": "Databases",
    "texts": [
"I am passionate about big data and data science, including storing and managing data in general. I have extensive experience in SQL databases and have recently started working with NoSQL databases like MongoDB or Redis. I enjoy discussing best practices and tricks to improve performance when dealing with big or unstructured data."
    ],
    "imageName": "-",
    "config": {
      "wrap": "mobile"
    }

  }
]
