[
  {
    "headline": "Quality Check With Computer Vision Algorithms",
    "texts": [
      "As part of my thesis project, I am proud to have developed a solution to a difficult problem faced during manufacturing processes. Our team created a production line monitoring system that utilized Raspberry Pi 4 boards equipped with cameras to capture real-time images and video streams of the manufacturing processes. We then processed this data to convert it into useful information, which was stored in a database for optimization purposes.",
      "My particular contribution to the project was an extra feature that checked for specific operations and detected any process failures before they could cause further issues. Overall, our goal was to monitor the processes and track events to improve efficiency and productivity."
    ],
    "imageName": "seeger",
    "onClick": {
      "type": "link",
      "index": "https://storage.googleapis.com/www.bormilan.com/Bo%CC%81rMila%CC%81n_szakdolgozat.pdf"
    },
    "stamps": [
      {
        "type": "",
        "text": "Computer Vision"
      },
      {
        "type": "",
        "text": "OpenCV"
      },
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Research"
      },
      {
        "type": "",
        "text": "Raspberry Pi"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Consumption Meter",
    "texts": [
      "The motivation behind this project was the high prices of water, electricity, and gas. We aimed to develop a system for storing consumption data to help people save money.",
      "We came up with a solution that involves placing small and inexpensive detectors on top of water and other meters. These detectors use computer vision and image processing to read the number plates.",
      "Here's how it works: the user buys a detector, attaches it to their meter, and adds the detector's ID to our program on the client side. After this, they just need to configure the detector, and it can start detecting numbers.",
      "The detector sends an image to our backend, where an OCR model processes the image to extract the numbers. The numbers are then stored in our MongoDB database.",
      "Our program has many features to help users get the most valuable information from their data. We plan to create a customizable dashboard for users and a mobile application that allows them to take images with their phones. We also want to add features that support people who own multiple properties and need to monitor the consumption of their renters."
    ],
    "imageName": "cm_img",
    "onClick": {
      "type": "link",
      "index": "https://cm.balintdaniel.com"
    },
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Flask"
      },
      {
        "type": "",
        "text": "MongoDB"
      },
      {
        "type": "",
        "text": "GCP API"
      },
      {
        "type": "",
        "text": "React"
      },
      {
        "type": "",
        "text": "Typescript"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "beamLive",
    "texts": [
      "During my recent project, I was responsible for developing the client-side of a chat-based application. My initial task was to replicate the design of the old application, and then adjust the panel according to the client's requirements. The platform featured nested menu elements, along with windows that could contain components or child windows. I developed it using React with Typescript and used two component libraries, Material UI and Syncfusion."
    ],
    "imageName": "beam_img",
    "onClick": {
      "type": "link",
      "index": "https://beam.live"
    },
    "stamps": [
      {
        "type": "",
        "text": "React"
      },
      {
        "type": "",
        "text": "Typescript"
      },
      {
        "type": "",
        "text": "Json"
      },
      {
        "type": "",
        "text": "mqtt"
      },
      {
        "type": "",
        "text": "Redis"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Document Storing Database, with Web Scraping",
    "texts": [
      "I worked on my very first freelance project with a friend. We were hired by a German company to improve their data processing. Our goal was to scrape fresh data from their old website, store it in a new database, and create an efficient query system. We also built a new client application that included many useful features to speed up their everyday work.",
      "This project was a great learning experience for me. I gained knowledge in working with big data, downloading data via RSS feeds, and creating automatic cron jobs to fetch data daily. I also became familiar with backend development, and practical data processing, and learned how to work on a real-life project."
    ],
    "imageName": "",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Flask"
      },
      {
        "type": "",
        "text": "Beautiful Soup"
      },
      {
        "type": "",
        "text": "RSS"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Online Platform for Craft Events",
    "texts": [
      "As a backend developer, I worked for a startup that had already launched their MVP. My role was to fix bugs and add new features to the existing codebase. During my time there, I added several new features, including a new user type that could advertise their events, similar to how sellers on Fiverr promote their services. I also implemented a refund feature that allowed customers to cancel only specific registrations instead of the entire order. Additionally, I automated email sending and completed several other tasks to improve the project's overall functionality."
    ],
    "imageName": "marminalunk",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Flask"
      },
      {
        "type": "",
        "text": "MySql"
      },
      {
        "type": "",
        "text": "Stripe"
      },
      {
        "type": "",
        "text": "MailGun"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "NBA Data Analysis",
    "texts": [
      "I extracted data from the official NBA website using a wrapper called 'nba_api'. My objective was to gather insights from the statistics available and use them to make more informed bets. I compared teams to decide which one to select for winning the game. I also conducted a single-team analysis to see their overall statistics, including points, rebounds, assists, and more. Additionally, I performed player analysis to examine individual player statistics."
    ],
    "imageName": "",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Pandas"
      },
      {
        "type": "",
        "text": "Data Processing"
      },
      {
        "type": "",
        "text": "Machine Learning"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  }
]
