[
  {
    "headline": "Quality Check With Computer Vision Algorithms",
    "texts": [
      "This is my thesis project. I am very proud of the outcome of this, because this was a real problem that was needed to solve, and it was a really hard challenge.",
      "The goal of this project was to make a solution for a specific problem during a manufacturing process.",
      "My team developed a production line monitoring system. We used Raspberry Pi 4 boards with camera, to take images and real time video stream from the manufacturing processes, and processed the images and the stream to convert them into useful data.",
      "The main goal was to monitoring the processes and store the events in a database, for the purpose of optimization.",
      "And there was my part, an extra feature to check a specific operation and detect if the process failed, before it causes more problems."
    ],
    "imageName": "seeger",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Computer Vision"
      },
      {
        "type": "",
        "text": "OpenCV"
      },
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Research"
      },
      {
        "type": "",
        "text": "Raspberry Pi"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Consumption Meter",
    "texts": [
      "The need for this project was caused by the high prices of the water, electricity and gas. The goal was to make a system for storing consumption data, for the purpose of saving.",
      "We came up with a solution that placing small and cheap detectors on the top of the water(etc.) meters, and read the number plate with computer vision and image processing.",
      "The process looks like this: the user buys a detector, applies to their clock, and adds the detector by its ID, on the client side of our program. After this he/she/it just need to set the configuration values, and then the detector can start detecting the numbers.",
      "The detector sends an image to our backend, and then it processes the image to get the numbers from it, with an OCR model, and the it stores to our database(mongoDB).",
      "The client has a lot of features to help the user get the most valuable information from the data.",
      "Our plan, is to make a dashboard that is customizable by the user. Making a mobile application to afford the possibility to make the images with phone And we want to make a lot of features that supports those people who has multiply property to monitor the consumption of their renters."
    ],
    "imageName": "cm_img",
    "onClick": {
      "type": "link",
      "index": ""
    },
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Flask"
      },
      {
        "type": "",
        "text": "MongoDB"
      },
      {
        "type": "",
        "text": "GCP API"
      },
      {
        "type": "",
        "text": "React"
      },
      {
        "type": "",
        "text": "Typescript"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Document Storing Database, with Web Scraping",
    "texts": [
      "This was my firs ever freelance project that I worked on with my friend. We did this project for a German company, to improve their data processing. ",
      "The goal was to scrape the fresh data form their old website, to store in my a new, for the purpose of making efficient queries and to serve a new client application that implements a lot of good features that speeds ups their everyday work.",
      "This was a good first project that taught me how to work with big data, how to download data through RSS feed, and make an automatic cron job to make it every day. A got familiar with backend development, practical data processing and in general how things work on a real life project."
    ],
    "imageName": "",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Flask"
      },
      {
        "type": "",
        "text": "Beautiful Soup"
      },
      {
        "type": "",
        "text": "RSS"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "Online Platform for Craft Events",
    "texts": [
      "This project was a startup that I worked for as a backend developer. I joined the team after the MVP, so it was a good experience in working on an existing project and catch up the code.",
      "I made bug fixes, and several new features. These are new user type who can advertise their events(like sellers on Fiverr), refund feature with option to refund just a specific numbers of registration(e.g. registered 4 people but 2 of them wants to cancel it), automatic e-mail sending, and several smaller tasks."
    ],
    "imageName": "marminalunk",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Flask"
      },
      {
        "type": "",
        "text": "MySql"
      },
      {
        "type": "",
        "text": "Stripe"
      },
      {
        "type": "",
        "text": "MailGun"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  },
  {
    "headline": "NBA Data Analysis",
    "texts": [
      "I gathered the data from the official nba site, with a wrapper called nba_api. The goal was to find information in the statistics, and make insights to make more profit in betting.",
      "I made team comparisons to help decide what team should I pick to win the game. I made single team analysis to see the team overall statistics(sum of points, rebounds, assists etc). And I made player analysis too to see the player’s stats."
    ],
    "imageName": "",
    "onClick": "",
    "stamps": [
      {
        "type": "",
        "text": "Python"
      },
      {
        "type": "",
        "text": "Pandas"
      },
      {
        "type": "",
        "text": "Data Processing"
      },
      {
        "type": "",
        "text": "Machine Learning"
      }
    ],
    "config": {
      "wrap": "mobile"
    }
  }
]
